# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя способами

enter_text = input('Введите текст')
print(enter_text.replace(' ', '-'))

print(input('Введите текст').replace(' ', '-'))
