# Пользователь вводит 3 числа, найти среднее арифметическое с точностью 3

print(round((float(input('Введите первое число'))
           + float(input('Введите второе число'))
           + float(input('Введите третье число')))/3, 3))
